; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v7)
		(pred_4 ?v4)
		(pred_5 ?v8)
		(pred_1 ?v8)
		(pred_3 ?v4 ?v8)
		(pred_2)
		(pred_6 ?v4))

   (:action op_3
       :parameters  (?v2 ?v1)
       :precondition (and (not-eq ?v2 ?v1) 
                          (pred_5 ?v2) (pred_5 ?v1) (pred_1 ?v2))
       :effect (and  (pred_1 ?v1)
		     (not (pred_1 ?v2))))


   (:action op_2
       :parameters (?v3 ?v6)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v6)
			    (pred_3 ?v3 ?v6) (pred_1 ?v6) (pred_2))
       :effect (and (pred_6 ?v3)
		    (not (pred_3 ?v3 ?v6)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v3  ?v6)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v6)
			    (pred_6 ?v3) (pred_1 ?v6))
       :effect (and (pred_3 ?v3 ?v6)
		    (pred_2)
		    (not (pred_6 ?v3)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_01 obj_05 obj_06 obj_03 obj_08 obj_04 
          obj_07 obj_09 obj_02 
)
(:init
(pred_5 obj_01)
(pred_5 obj_05)
(pred_5 obj_06)
(pred_5 obj_03)
(pred_5 obj_08)
(pred_5 obj_04)
(pred_4 obj_07)
(pred_4 obj_09)
(pred_4 obj_02)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(pred_2)
(pred_3 obj_07 obj_08)
(pred_3 obj_09 obj_08)
(pred_3 obj_02 obj_06)
(pred_1 obj_06)
)
(:goal
(and
(pred_3 obj_07 obj_04)
(pred_3 obj_09 obj_08)
(pred_3 obj_02 obj_06)
)
)

(:constraints
  (sometime-before  (pred_3 obj_07 obj_04) (pred_1 obj_01))
)
)

; plan
1. (op_3 obj_06 obj_08)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_08)
   goals met: 2 of 3
2. (op_2 obj_09 obj_08)
   deleted: (pred_3 obj_09 obj_08) (pred_2)
   added: (pred_6 obj_09)
   goals met: 1 of 3
3. (op_3 obj_08 obj_01)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_01)
   goals met: 1 of 3
4. (op_1 obj_09 obj_01)
   deleted: (pred_6 obj_09)
   added: (pred_3 obj_09 obj_01) (pred_2)
   goals met: 1 of 3
5. (op_3 obj_01 obj_08)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_08)
   goals met: 1 of 3
6. (op_2 obj_07 obj_08)
   deleted: (pred_3 obj_07 obj_08) (pred_2)
   added: (pred_6 obj_07)
   goals met: 1 of 3
7. (op_3 obj_08 obj_04)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_04)
   goals met: 1 of 3
8. (op_1 obj_07 obj_04)
   deleted: (pred_6 obj_07)
   added: (pred_3 obj_07 obj_04) (pred_2)
   goals met: 2 of 3
9. (op_3 obj_04 obj_01)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_01)
   goals met: 2 of 3
10. (op_2 obj_09 obj_01)
   deleted: (pred_3 obj_09 obj_01) (pred_2)
   added: (pred_6 obj_09)
   goals met: 2 of 3
11. (op_3 obj_01 obj_08)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_08)
   goals met: 2 of 3
12. (op_1 obj_09 obj_08)
   deleted: (pred_6 obj_09)
   added: (pred_3 obj_09 obj_08) (pred_2)
   goals met: 3 of 3
